#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.poe_ladder_exporter will be created
  + resource "aws_cloudwatch_event_rule" "poe_ladder_exporter" {
      + arn                 = (known after apply)
      + description         = "triggers the poe_ladder_exporter every minute"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "poe_ladder_exporter"
      + schedule_expression = "rate(30 minutes)"
      + tags                = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
    }

  # aws_cloudwatch_event_target.poe_ladder_exporter will be created
  + resource "aws_cloudwatch_event_target" "poe_ladder_exporter" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "poe_ladder_exporter"
      + target_id = "poe_ladder_exporter"
    }

  # aws_dynamodb_table.poe_api_export_cache will be created
  + resource "aws_dynamodb_table" "poe_api_export_cache" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "character_name"
      + id               = (known after apply)
      + name             = "poe_item_alerts_characters"
      + range_key        = "account_name"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)

      + attribute {
          + name = "account_name"
          + type = "S"
        }
      + attribute {
          + name = "character_name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.poe_character_exporter_execution will be created
  + resource "aws_iam_policy" "poe_character_exporter_execution" {
      + arn         = (known after apply)
      + description = "Allows the lambda function to write to SNS for deadletter and to dynamo db"
      + id          = (known after apply)
      + name        = "poe_character_exporter_execution"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:*",
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ICannotBeAskedToAlsoFixThisUp"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.poe_character_exporter_sfn will be created
  + resource "aws_iam_policy" "poe_character_exporter_sfn" {
      + arn         = (known after apply)
      + description = "Allows the step functions to invoke lambdas"
      + id          = (known after apply)
      + name        = "poe_character_exporter_sfn"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ICannotBeAskedToAlsoFixThisUp"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.poe_ladder_exporter_execution will be created
  + resource "aws_iam_policy" "poe_ladder_exporter_execution" {
      + arn         = (known after apply)
      + description = "Allows the lambda function to write to SNS for deadletter and to SQS for further components"
      + id          = (known after apply)
      + name        = "poe_ladder_exporter_execution"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "sns:Publish",
                          + "states:StartExecution",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ICannotBeAskedToAlsoFixThisUp"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.poe_character_exporter will be created
  + resource "aws_iam_role" "poe_character_exporter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "poe_character_exporter_execution"
      + path                  = "/"
      + tags                  = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.poe_character_exporter_sfn will be created
  + resource "aws_iam_role" "poe_character_exporter_sfn" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "states.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "poe_character_exporter_execution_sfn"
      + path                  = "/"
      + tags                  = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.poe_ladder_exporter will be created
  + resource "aws_iam_role" "poe_ladder_exporter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "poe_ladder_exporter_execution"
      + path                  = "/"
      + tags                  = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.poe_api_exporter_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "poe_api_exporter_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "poe_ladder_exporter_execution"
    }

  # aws_iam_role_policy_attachment.poe_character_exporter will be created
  + resource "aws_iam_role_policy_attachment" "poe_character_exporter" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "poe_character_exporter_execution"
    }

  # aws_iam_role_policy_attachment.poe_character_exporter_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "poe_character_exporter_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "poe_character_exporter_execution"
    }

  # aws_iam_role_policy_attachment.poe_character_exporter_sfn will be created
  + resource "aws_iam_role_policy_attachment" "poe_character_exporter_sfn" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "poe_character_exporter_execution_sfn"
    }

  # aws_iam_role_policy_attachment.poe_ladder_exporter will be created
  + resource "aws_iam_role_policy_attachment" "poe_ladder_exporter" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "poe_ladder_exporter_execution"
    }

  # aws_lambda_function.poe_character_exporter will be created
  + resource "aws_lambda_function" "poe_character_exporter" {
      + arn                            = (known after apply)
      + description                    = "Exports the poe character window API into a cache"
      + filename                       = "../src/poe_character_exporter-refs/pull/1/merge.zip"
      + function_name                  = "poe_character_exporter"
      + handler                        = "poe_character_exporter.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.poe_ladder_exporter will be created
  + resource "aws_lambda_function" "poe_ladder_exporter" {
      + arn                            = (known after apply)
      + description                    = "Exports the poe character window API into a cache"
      + filename                       = "../src/poe_ladder_exporter-refs/pull/1/merge.zip"
      + function_name                  = "poe_ladder_exporter"
      + handler                        = "poe_ladder_exporter.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "poe_ladder_exporter"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudwatch"
    }

  # aws_sfn_state_machine.character_loader will be created
  + resource "aws_sfn_state_machine" "character_loader" {
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "poe_character_exporter"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags          = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
    }

  # aws_sns_topic.deadletter will be created
  + resource "aws_sns_topic" "deadletter" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "poe_ladder_exporter_deadletter"
      + policy = (known after apply)
      + tags   = {
          + "Application" = "poe-item-alerts"
          + "Component"   = "poe-ladder-exporter"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `infra`, Workspace: `default`*
